package com.example.dictionary1;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.SearchView;
import androidx.appcompat.widget.Toolbar;
import androidx.recyclerview.widget.DividerItemDecoration;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuItem;

import java.util.ArrayList;
import java.util.List;

public class MainActivity extends AppCompatActivity implements UsersAdapter.SelectedUser {

    Toolbar toolbar;
    RecyclerView recyclerView;

    List<UserModel> userModelList = new ArrayList<>();

    String[] names = {
            "កម្ដៅ	ជាបរិមាណថាមពលកម្ដៅដែលផ្ទេរពីអង្គធាតុក្ដៅទៅអង្គធាតុត្រជាក់។"
            ,"កម្ដៅម៉ាស	ជាបរិមាណកម្ដៅចាំបាច់ដែលត្រូវផ្ដល់ឲ្យអង្គធាតុ 1kg ឬដកចេញពីអង្គធាតុដើម្បីតម្លើងឬតម្ហយសីតុណ្ហភាព 10C។"
            ,"កម្ទេចកំណ	អង្គធាតុរឹង(ដុំថ្ម ក្រួស ខ្សាច់.  .  .) ដែលដឹកជញ្ជូននិងចាក់បង្កដោយខ្យល់ ចរន្តទឹក ឬទឹកនៅបាតស្ទឹង បឹងទន្លេ សមុទ្រ ជាដើម។"
            ,"កម្មន្ត	ជាថាមពលដែលផ្ទេរទៅឲ្យអង្គធាតុ ឬបានមកពីអង្គធាតុដោយសារកម្លាំងដែលមានអំពើលើអង្គធាតុនោះ។ជាផលគុណរវាងកម្លាំងនិងបម្លាស់ទី។"
            ,"កម្លាំងអន្តរម៉ូលេគុល	កម្លាំងខ្សោយដែលកើតឡើងរវាងម៉ូលេគុលទាំងឡាយ។"
            ,"ករនេ	ជាស្រទាប់ថ្លាដែលស្រោបខាងក្រៅកែវភ្នែក។"
            ,"កាចុង	ជាអ៊ីយ៉ុងដែលមានបន្ទុកវិជ្ជមាន។"
            ,"កាតាលីករ	សារធាតុដែលជួយបង្កើនល្បឿនឬពន្យឺតល្បឿនប្រតិកម្មគីមីមួយ ហើយក្រោយប្រតិកម្ម បរិមាណ និងសមាភាពរបស់វានៅដដែល។"
            ,"កាម៉ែតូភីត	សារពាង្គកាយរុក្ខជាតិដែលដុះចេញពីស្ប៉ ហើយផលិតកាម៉ែតទាំងពីរភេទឬប្រភេទណាមួយ។"
            ,"កាលសម័យ	ឯកតារង្វាស់ធរណីកាលដែលតូចជាងស័ក។"
            ,"កាឡាក់ស៊ី	ជាកញ្ចុំផ្កាយនៅក្នុងលំហ។"
            ,"កុម្មុយតាទ័រ	ជាកងលោហៈក្នុងម៉ូទ័រដើរដោយចរន្តជាប់ប្រើប្រាស់សម្រាប់ប្តូរទិសដៅចរន្តអគ្គិសនីក្នុងបូប៊ីនរាល់កន្លះជុំម្ដង។"
            ,"កូទីឡេដុង	ក្លែបអំប្រ៊ីយ៉ុងក្នុងគ្រាប់រុក្ខជាតិដែលផ្ដល់អាហារដល់កូនរុក្ខជាតិ។"
            ,"កោសិកា និងមជ្ឈដ្ឋានខាងក្រៅ។"
            ,"ក្រាភិច	ទម្រង់នៃកាបូនដែលមានការត្រៀមអាតូមជាស្រទាប់ៗ។វាជា សារធាតុពណ៌ខ្មៅទន់ គេប្រើជាបណ្ដូរខ្មៅដៃនិងក្នុងឧបរណ៍អគ្គិសនី។"
            ,"ក្លរ៉ូប្លាស	ធាតុកោសិការុក្ខជាតិដែលផ្ទុកជាតិពណ៌(ក្លរ៉ភីល)និងជាកន្លែងធ្វើរស្មីសំយោគ។"
            ,"កំណក	ដំណើរការផ្លាស់ប្ដូរពីអង្គធាតុរាវទៅអង្គធាតុរឹង។"
            ,"កំណជាញើស	ជាការបប្លែងពីភាពជាចំហាយទៅជាភាពជាញើស។"
            ,"កាំរស្មីស្វាយអ៊ុយត្រា	ជាកាំរស្មីពន្លឺព្រះអាទិត្យដែលបញ្ចេញមក។"
            ,"ខួរឆ្អឹង	ជាលិកានៅក្នុងប្រហោងកណ្ដាលនៃឆ្អឹងមួយចំនួនដែលផលិតកោសិកាឈាមនិងស្តុកខ្លាញ់លើស។"
            ,"ខ្យល់ជំនោរទ្វីប	ចលនាខ្យល់ពីទ្វីបទៅសមុទ្រនៅពេលយប់។"
            ,"ខ្យល់ជំនោរសមុទ្រ	ចលនាខ្យល់ពីសមុទ្រទៅទ្វីបនាពេលថ្ងៃ។"
            ,"ខ្សែវ័ណ្ឌអេក្វាទ័រ	ខ្សែសន្មតចែកផែនដីជាពីរផ្នែកគឺអឌ្ឍគោលខាងជើងនិងអឌ្ឍគោលខាងត្បូង។"
            ,"គីទីន	ប៉ូលីសាក់ការីតដែលកើតឡើងពីគ្លុយកូសជាច្រើន ហើយទម្រង់របស់វាដូចគ្នាទៅនឹងសែលុយឡូស។វាបង្កើតជាគ្រោងឆ្អឹងក្រៅ (សំបក ស្នូក)របស់ឧង្គសត្វ គ្រុយស្ដាសសេ និងអាកត្រូប៉ូត។"
            ,"គីស	ទម្រង់រាងដូចថង់ដែលមានភ្នាសព័ទ្ធជុំវិញសារពាង្គកាយមួយ(ស្ថិតក្នុងវគ្គសំងំ)។"
            ,"គុយទីគុល	សារធាតុក្រមួនដែលគ្របពីលើអេពីឌែមរបស់ស្លឹកនិងរបស់ដើមរុក្ខជាតិភាគច្រើន។ភ្នាសស្វិតស្ថិតនៅផ្នែកខាងក្រៅនៃសារពាង្គកាយដង្កូវបរាសិតខ្លួនសំប៉ែតដែលការពារទប់ទល់នឹងសកម្មភាពរំលាយនៃធ្មួលរបស់វា។"
            ,"គុយទីន	សារធាតុក្រមួន នៅក្នុងសំណើផ្ទុកនូវអាស៊ីតខ្លាញ់និងអ៊ីដ្រុកស៊ីតដែលភ្ជាប់ជាមួយគ្នាតាមលំដាប់មួយសាំញ៉ាំ។"
            ,"គ្លីកូសែន	គ្លុយស៊ីតដែលកើតឡើងពីម៉ូលេគុលគ្លុយកូសជាច្រើន។"
            ,"គ្លុយស៊ីត	ម៉ូលេគុលសរីរាង្គដែលកើតឡើងពីកាបូន អ៊ីដ្រូសែននិងអុកស៊ីសែននិងមានរូបមន្ត(C6H12O6)។ឧទាហរណ៍ អាមីដុង គ្លីកូសែន.  .  .  ។"
            ,"ចរន្តឆ្លាស់	ជាចរន្តអគ្គិសនីដែលប្ដូរទិសដៅពីរដងក្នុងមួយខួប។"
            ,"ចល័ត	ជាការផ្លាស់ទីរបស់វត្ថុ។"
            ,"ច្បាប់ទី១ញូតុន	បើអង្គធាតុមួយមិនរងអំពើនៃកម្លាំងផ្សេងៗទេ ឬវារងតែកម្លាំងផ្គួបស្មើសូន្យ បើវានៅនឹងថ្កល់វានៅនឹងដដែល តែបើវាមានចលនា ចលនានោះជាចលនាត្រង់ស្មើ។"
            ,"ច្បាប់ទី២ញូតុន	សំទុះនៃអង្គធាតុមួយសមាមាត្រទៅនឹងកម្លាំងផ្គួបដែលមានអំពើលើវា ហើយច្រាសសមាមាត្រនឹងម៉ាសរបស់វា។"
            ,"ច្បាប់ទី3ញូតុន	បើវត្ថុពីរមានអំពើទៅវិញទៅមក(អំពើនិងប្រតិកម្ម)ដោយកម្លាំង F12  ដែលបញ្ចេញដោយវត្ថុទី1ទៅលើវត្ថុទី2មានទំហំស្មើគ្នា និងមានទិសដៅផ្ទុយពីកម្លាំងF21 ដែលបញ្ចេញដោយវត្ថុទី2មកលើវត្ថុទី1។ គេសរសេរ F12  = - F21"
            ,"ចំណុចកំណុំ	ជាចំណុចរួមនៃបាច់ពន្លឺប្រសព្វគ្នាត្រង់ចំណុចមួយ។"
            ,"ចំណាំងបែរនៃពន្លឺ	ជាការដាលពន្លឺឆ្លងកាត់ពីមជ្ឈដ្ឋានមួយ ទៅមជ្ឈដ្ឋានមួយទៀតហើយមានលំងាក គេហៅថា ចំណាំងបែរ។"
            ,"ចំណាំងផ្លាតនៃពន្លឺ	ជាការដាលពន្លឺឆ្លងកាត់ពីមជ្ឈដ្ឋានមួយ ហើយពន្លឺទាំងនោះត្រូវបានចាំងត្រឡប់មកវិញ គេហៅថាចំណាំងផ្លាត។"
            ,"ជាលិកា	កោសិកាដូចចគ្នាមួយក្រុមដែលធ្វើការជាមួយគ្នា ដើម្បីបំពេញមុខងាររួមមួយ។ឧទាហរណ៍ ជាលិកាសាច់ដុំ ជាលិកាអេពីឌែម។"
            ,"ជាលិកាសន្ធាន	ក្រុមជាលិកាឯកទេសដែលមាននាទីភ្ជាប់និងទ្រទ្រង់ផ្នែកផ្សេងៗនៃសារពាង្គកាយ។"
            ,"ជ័រធ្យូងថ្ម	បំណិតធ្យូងថ្មឲ្យក្លាយជាធ្យូងកូក។"
            ,"ដង្ហើមកោសិកា	ដំណើររការបំបែកម៉ូលេគុលអាហារ តាមរយៈការធ្វើអុកស៊ីតកម្មនៅក្នុងមីតូកុងឌ្រីដើម្បីផលិតថាមពលគីមីដែលកោសិកាអាចប្រើប្រាស់បាន។"
            ,"ដង់ស៊ីតេ	ម៉ាសក្នុងមួយខ្នាតមាឌ ជាទូទៅគិតជាក្រាមក្នុងមួយសង់ទីម៉ែតគូបឬក្រាមក្នុងមួយមីលីលីត។"
            ,"ដីបាស	ដីមានជាតិប្រៃ។ដីប្រភេទនេះរុក្ខជាតិភាគច្រើនមិសូវដុះលូតលាស់បានល្អទេ។"
            ,"ដីល្អ	ប្រភេទដីមានជីវជាតិដែលមានមីក្រូសារពាង្គកាយរស់នៅច្រើន។ដីប្រភេទនេះអាចឲ្យដំណាំលូតលាស់បានល្អនិងទទួលបានទិន្នផលខ្ពស់។"
            ,"ដីអាស៊ីត	ប្រភេទដីមានជាតិជូ។ដំណាំភាគច្រើនមិនសូវដុះលូតលាស់ល្អលើដីប្រភេទនេះទេ។"
            ,"ដែនគំហើញ	ជាលំហដែលភ្នែកអាចមើលឃើញច្បាស់"
            ,"ដំបង	ជាសេនសឺនៃពន្លឺស្រអាប់។"
            ,"ឋបនីយជីវមណ្ឌល	តំបន់ការពារប្រព័ន្ធអេកូឡូស៊ីសំខាន់ៗនៅលើពិភពលោក សម្រាប់ការអប់រំវិទ្យាសាស្ត្រនិងរប្បធម៌។"
            ,"តារាវិទ្យា	វិទ្យាសាស្ត្រដែលសិក្សាពីចលនា ទីតាំង ការធៀបទម្រង់ ដំណើរវិវឌ្ឍន៍របស់ផ្កាយនិងអង្គធាតុក្នុងសកលលោក ក្រៅបរិយាកាសផែនដី។"
            ,"តេឡេទស្សន៍	ជាឧបករណ៍ប្រើសម្រាប់មើលវត្ថុនៅឆ្ងាយៗ។"
            ,"ត្រង់ស្វូ	ជាឧបករណ៍ប្រើសម្រាប់តម្លើងឬតម្ហយតង់ស្យុង។"
            ,"ថលជលិក	សត្វឆ្អឹងកងដែលមានឈាមត្រជាក់អាចរស់នៅក្នុងទឹកក៏បាននិងលើគោកក៏បាន។"
            ,"ថាមពលប៉ូតង់ស្យែល	ជាថាមពលដែលអាស្រ័យទៅនឹងទីតាំងវត្ថុ។"
            ,"ថាមពលស៊ីនេទិច	ជាថាមពលដែលមានទំនាកទំនងទៅនឹងល្បឿនវត្ថុ។"
            ,"ទម្រង់អេឡិចត្រូនិច	ជាការតម្រៀបអេឡិចត្រុងតាមស្រទាប់នៅក្នុងអាតូមមួយ។ឧទាហរណ៍ :ធាតុស្ពាន់ធ័រ(S) មានលេខអាតូម 16ទម្រង់ អេឡិចត្រូនិចរបស់ស្ពាន់ធ័រគឺ (K)2, (L)8, (M)6   ។"
            ,"ទែម៉ូឌីណាមិច	ជាផ្នែកមួយនៃរូបវិទ្យាដែលសិក្សាអំពីកម្ដៅ។"
            ,"ធរណីវិទ្យាឬ ភូគព្តសាស្ត្រ វិទ្យាសាស្ត្រដែលសិក្សាពីកំណកំណើតប្រវត្តិ សមាសភាព ទម្រង់ផែនដី និងរូបធាតុដែលផ្សំផែនដី។"
            ,"ធាតុកោសិកា	ទម្រង់ពិសេសដែលស្ថិតនៅក្នុងស៊ីតូប្លាសរបស់កោសិកាមាននាទី ដោយឡែកៗពីគ្នាក្នុងមេតាបូលីសកោសិកា។"
            ,"ធ្យូង	ជាកុងតាក់សម្រាប់ផ្ដល់ចរន្តទៅឲ្យកុម្មុយតាទ័រ។"
            ,"និរន្តរភាព	បរិមាណនៃធនធានមួយជាកំណត់ ដែលអាចផលិតជាអចិន្ត្រៃយ៍ដោយចីរភាពក្រោមវិធីសាស្ត្រគ្រប់គ្រងមួយ(ដូចជា ការកំណត់អត្រាដកហូត ឬប្រមូលផលឲ្យស្មើគ្នាទៅនឹងអត្រាផលិតដោយធម្មជាតិ។"
            ,"បរាសិត	ភាវៈរស់ដែលរស់នៅលើឬក្នុងភាវៈរស់មួយទៀតហើយស្រូបយកសារធាតុចិញ្ចឹមពីភាវៈរស់នោះ។"
            ,"បរិស្ថាន	មជ្ឈដ្ឋាននៅជុំវិញខ្លួនយើងទាំងអស់ ឬសំណុំលក្ខខណ្ឌក្រៅទាំងអស់ដែលមានឥទ្ធិពលដល់ជីវិតនិងការលូតលាស់របស់បណ្ដាភាវៈ។"
            ,"ប៉ូលីមែ	សារធាតុដែលបង្កឡើងពីម៉ូលេគុលធំៗកើតឡើងពីការផ្គុំគ្នានៃម៉ូលេគុលតូចៗ(ម៉ូណូមែ)ដូចគ្នាច្រើន។"
            ,"ប៉ែលីគុល	ស្រទាប់ប្រូតេអ៊ីនក្រាស់ព័ន្ធជុំវិញភ្នាសកោសិការបស់ប្រូទីសមួយចំនួន។"
            ,"ប្រដាប់របត់ឈាមទោល	ដំណើរឈាមរត់មួយជុំគឺ ចេញពីបេះដូងទៅសរីរាង្គហើយត្រឡប់ចូលបេះដូងវិញ។"
            ,"ប្រដាប់របត់ឈាមទ្វេ	ដំណើរឈាមរត់ពីរជុំ គឺចេញពីបេះដូងទៅសួត ហើយត្រឡប់ចូលបេះដូងវិញនិងចេចញពីបេះដូងទៅសរីរាង្គហើយត្រឡប់ចូលបេះដូងវិញ។"
            ,"ប្រដាប់របត់ឈាមបិទ	ប្រដាប់របត់ឈាមដែលឈាមធ្វើចលនាតែក្នុងសរសៃរឈាមប៉ុណ្ណោះ។ឧទាហរណ៍ ត្រី ជន្លេន បក្សី.  .  .។"
            ,"ប្រព័ន្ធខ្នាតអន្តរជាតិ	ជាខ្នាតនិងខ្នាតគំរូនៃរង្វាស់ដែលអ្នកវិទ្យាសាស្ត្រទូទាំងពិភពលោកប្រើប្រាស់។"
            ,"បំណិតប្រភាគ	គឺញែកធាតុបង្កនៃល្បាយវត្ថុរាវ ដែលរលាយចូលគ្នា។វត្ថុរាវទាំងនោះមានសីតុណ្ហភាពរំពុះខុសៗគ្នា។"
            ,"ផូស៊ីល	រុក្ខជាតិនិងសត្វដែលងាប់ហើយកប់ក្នុងដី ឬថ្មដែលមានរយៈពេលរាប់លានឆ្នាំ។"
            ,"ផូស៊ីលឥន្ធនៈ	ជាផូស៊ីលដែលផ្ដល់ជាតិប្រេង ឧទាហរណ៍ ខ្ចៅ ខ្យង គ្រំ.  .  .។"
            ,"ផូសីល	ដាននៃសត្វ និងរុក្ខជាតិ ឬសំណល់នៃផ្នែកមួយនៃសរីរាង្គ ឬភាវៈរស់ទាំងមូល ដែលរក្សាទុកក្នុងសិលាតាំងពីរាប់លានឆ្នាំមកហើយ។"
            ,"ភ្នាសស៊ីតូប្លាស	ភ្នាសព័ទ្ធជុំវិញស៊ីតូប្លាសកោសិកា។វាមាននាទីក្នុងបណ្តូររូបធាតុរវាង"
            ,"មណ្ឌលជីវៈ	ផ្នែកនៃផែនដីរួមមាន ស្រទាប់ក្រោមនៃបរិយាកាស មណ្ឌលទឹក និងភាគខាងលើនៃមណ្ឌលថ្ម ដែលមានសារពាង្គកាយមានជីវិតរស់នៅ។"
            ,"មណ្ឌលអាកាស	ស្រទាប់ឧស្ម័នដែលគ្របដណ្ដប់ជុំវិញផែនដីមានកម្រាស់ប្រមាណ500Km។"
            ,"ម៉ាក្រូម៉ូលេគុល	ជាម៉ូលេគុលធំៗ។គេប្រើសម្រាប់ពណ៌នាអំពីម៉ូលេគុល។"
            ,"ម៉ូទ័រ	ជាគ្រឿងបំប្លែងថាមពលអគ្គិសនីទៅជាថាមពលមេកានិច។"
            ,"ម៉ូលេគុល	ក្រុមអាតូមដែលចងសម្ព័ន្ធជាមួយគ្នាក្នុងសមាមាត្រកំណត់មួយ ដើម្បីបង្កជាសមាសធាតុ។ ឧទាហរណ៍ : អាតូមអ៊ីដ្រូសែនពីរ អុកស៊ីសែនមួយបង្កើតបានជាម៉ូលេគុលទឹក H2O ។"
            ,"មាត្រដ្ឋានសីតុណ្ហភាព	ជាគំនូសក្រិតដែលសម្គាល់ឲ្យទំហំខ្នាតសីតុណ្ហាភាព។"
            ,"មីក្រូសារពាង្គកាយ	សារពាង្គកាយតូចបំផុតដែលគេមិនអាចមើលឃើញនឹងភ្នែកទទេបានឡើយតែអាចមើលឃើញនឹងមីក្រូទស្សន៍បាន។"
            ,"មេតាប៉ូលី	សំណុំប្រតិកម្មគីមីទាំងឡាយ នៅក្នុងសារពាង្គកាយរួមមាន ការលូតលាស់សម្រូបអាហារ សំយោគប្រូតេអ៊ីន។បណ្ដុំនៃរាល់សកម្មភាពបំបែក(អសមានកម្ម)និងសំយោគម៉ូលេគុល(សមានកម្ម)ដែលប្រព្រឹត្តទៅក្នុងកោសិកាហៅថា មេតាប៉ូលី។"
            ,"រូបធាតុ	ភាវៈដែលមានម៉ាសនិងមាឌក្នុងលំហ។"
            ,"រំពុះ	ជាការបង្កយ៉ាងរហ័សនៃអង្គធាតុរាវឲ្យកើតជាពពុះចំហាយដែលលេចចេញពីផ្ទៃអង្គធាតុរាវនោះ។"
            ,"រំហួត	ជាដំណើរផ្លាស់ពីភាពពីអង្គធាតុរាវទៅឧស្ម័ន។"
            ,"ល្បឿន	ជាការកំណត់ភាពលឿនឬយឺតនៃចលនា។"
            ,"លំនាំហេប៊ើ	លំនាំឧស្សាហកម្មសម្រាប់ផលិតអាម៉ូញាក់់ ដោយប្រតិកម្មអ៊ីដ្រូសែនជាមួយអាសូតលើសដោយយកកាតាលីករដែកនៅ 450oC និងសម្ពាធ250atm ។	ឧទាហរណ៍  : N2 +3H2O        NH3"
            ,"វ៉ាឡង់	ចំនួនបង្ហាញពីលទ្ធភាពបន្សំនៃធាតុមួយចំពោះធាតុមួយផ្សេងទៀត។"
            ,"វ៉ិចទ័រល្បឿន	ជាល្បឿនដែលបញ្ជាក់ទិសដៅច្បាស់លាស់។"
            ,"វិសមរូប	លក្ខណៈនៃអង្គធាតុរ៉ែទោលឬសមាសដែលមានទម្រង់ និងលក្ខណៈរូបផ្សេងៗគ្នា។"
            ,"វីរុស	ភាគតូចល្អិតបំផុតដលស្ថិតនៅចន្លោះភាវៈរស់និងភាវៈគ្មានជីវិត។"
            ,"សត្វថេរកម្ដៅ	សត្វដែលមានសីតុណ្ហភាពសារពាង្គកាយប្រែប្រួលតាមជ្ឈដ្ឋានជុំវិញ។"
            ,"សត្វទ្វេភេទ	សារពាង្គកាយមានពីរភេទដែលអាចបង្កើតកាម៉ែតញីផងនិងកាម៉ែតឈ្មោលផង។"
            ,"សត្វអថេរកម្ដៅ	សត្វដែលមានសីតុណ្ហភាពសារពាង្គកាយប្រែប្រួលតាមមជ្ឈដ្ឋានជុំវិញ។"
            ,"សន្ទនីយ	ជាអង្គធាតុរាវនិងឧស្ម័នដែលអាចហូរបាន។"
            ,"សមាសធាតុ	អង្គធាតុដែលកើតឡើងដោយបន្សំរវាងធាតុពីរឬច្រើន។"
            ,"សម្ព័ន្ធកូវ៉ាឡង់	សម្ព័ន្ធដែលកើតឡើងដោយការដាក់ហ៊ុនអេឡិចត្រុងជាទ្វេតា។"
            ,"សម្ព័ន្ធគីមី	កម្លាំងទំនាញរវាងអាតូមដែលបង្កឡើងដោយការបែងចែកឬការបញ្ជូនអេឡិចត្រុង។"
            ,"សម្ភារៈតំណពូជ	ជាម៉ូលេគុលADNដែលផ្ទុកព័ត៌មានសេនេទិចសម្រាប់សំយោគប្រូតេអ៊ីនដើម្បីកណត់លក្ខណៈរបស់ភាវៈរស់។"
            ,"សម្មតិកម្ម	ទ្រឹស្ដីឬច្បាប់ដែលមិនអាចពិតជាសកល។"
            ,"សម័យ	ឯកតារង្វាស់ធរណីកាល ដែលផ្សំបានជាកាលសម័យ។"
            ,"សរសៃរចំណង	សំណុំសរសៃរជាលិកាសន្ធានសម្រាប់ភ្ជាប់ឆ្អឹងនិងឆ្អឹងនៅត្រង់សន្លាក់។"
            ,"សរសៃរពួរ	សំណុំសរសៃរជាលិកាសន្ធាន សម្រាប់ភ្ជាប់សាច់ដុំទៅនឹងឆ្អឹង។"
            ,"សាគរវិទ្យា	វិទ្យាសាស្ត្រដែលសិក្សាអំពីលក្ខណៈរូប លក្ខណៈគីមី លក្ខណៈជីវសាស្ត្រ មហាសមុទ្រ និងសមុទ្រ ពីកំណកំណើតនិងពពួកសត្វនិងរុក្ខជាតិដែលរស់នៅក្នុងមជ្ឈដ្ឋានសមុទ្រ។"
            ,"សាច់ដុំវាវបី	សាច់ដុំដើមដៃដែលធ្វើឲ្យកំភួនដៃមានចលនា។វាមានចំណុចភ្ជាប់បីទៅនឹងឆ្អឹង។"
            ,"សាច់ដុំវាវពីរ	សាច់ដុំដែលស្ថិតនៅដើមដៃ ធ្វើឲ្យកំភួនដីមានចលនា។សាច់ដុំនេះមានចំណុចភ្ជាប់ពីរទៅនឹងឆ្អឹង។"
            ,"សិលាឃ្លាំង	សិលាស្ពោតមានសណ្ដាន ដូចជាអេប៉ុង។"
            ,"សីតុណ្ហភាព	ជាទំហំមួយដែលកំណត់កម្រិតកម្ដៅនិងកម្រិតត្រជាក់នៃអង្គធាតុ។"
            ,"សឺមីកុងឌុចទ័រ	ជាអង្គធាតុដែលមានរេស៊ីស្ដង់នៅចន្លោះអង្គធាតុចម្លងនិងអ៊ីសូឡង់។វាចម្លងចរន្តអគ្គិសនីខ្សោយបំផុត។"
            ,"សូលេណូអ៊ីត	ជាបូប៊ីនវែងដែលមានប្រវែងធំជាងកាំចាំពី5ដងឡើងទៅ។"
            ,"ស្តូម៉ាត	រន្ធតូចៗដែលស្ថិតនៅលើផ្ទៃផ្នែកខាងក្រោម។វាជាកន្លែងប្ដូរឧស្ម័នរវាងជាលិកាខាងក្នុងស្លឹកនិងបរិយាកាស។"
            ,"ស្ប៉	កោសិការាងឆ្មារៗដែលមានលទ្ធភាពលូតលាស់នៅក្នុងសារពាង្គកាយមួយថ្មី។"
            ,"ស្រទាប់អូសូន	ជាបណ្ដុំនៃអាតូមអុកស៊ីសែនដែលស្ថិតនៅកម្ពស់ពីផ្ទៃដីប្រមាណជាបណ្ដុំនៃអាតូមអុកស៊ីសែនដែលស្ថិតនៅកម្ពស់ពីផ្ទៃដីប្រមាណ30Km។"
            ,"អង់ទីប្យូទិច	សារធាតុគីមីប្រើប្រាស់សម្រាប់សម្លាប់បាក់តេរី។"
            ,"ឧតុភូតវិទ្យា	វិទ្យាសាស្ត្រដែលសិក្សាអំពីបរិយាកាសផែនដី លក្ខណៈបរិយាកាសនិងផែនដីទាំងអស់ ដែលកើតមាននៅក្នុងបរិយាកាស។"
            ,"អានុភាព	ជាផលធៀបរវាងកម្មន្ត និងរយៈពេលដែលបានបំពេញកម្មន្តនោះ។"
            ,"ឥន្ធនៈផូស៊ីល	សមាសធាតុកាបូន ឬអ៊ីដ្រូកាបួធម្មជាតិដែលកកើតឡើងពីការបំបែកធាតុនៃរូបធាតុសរីរាង្គនៅក្នុងសំបកផែនដីក្នុងធរណីកាលដោយពុំមានការចូលរួមពីខ្យល់។ឥន្ធនៈផូស៊ីលសំខាន់ៗមាន : ឧស្ម័នធម្មជាតិ ប្រេងកាត ធ្យូងថ្ម។"
            ,"ឧបករណ៍ចរន្តឆ្លាស់	ជាឧបករណ៍ប្រើសម្រាប់វាស់ចម្ងាយចរក្នុងរយៈពេលស្មើគ្នា។"
            ,"អាល់ទែណាទ័រ	ជាជនិតាចរន្តឆ្លាស់។"
            ,"អុកស៊ីត	ផលិតផលនៃប្រតិកម្មរវាងអុកស៊ីសែនជាមួយធាតុមួយទៀត។"
            ,"អ៊ីដ្រូកាបួ	សមាសធាតុផ្សំដោយកាបូននិងអ៊ីដ្រូសែន។"
            ,"អ៊ីយ៉ុងកុំផ្លិច	ក្រុមអាតូមឬរ៉ាឌីកាល់មានបន្ទុកអគ្គិសនីសាំញ៉ាំ។"
            ,"អេឡិចត្រុង	ជាធាតុបន្ទុកអគ្គិសនីដែលមានបន្ទុកអវិជ្ជមាន។"
            ,"អេឡិចត្រុងវ៉ាឡង់	ជាអេឡិចត្រុងស្រទាប់ក្រៅនៃអាតូមដែលទាក់ទងក្នុងការចងសម្ព័ន្ធគីមី។"
            ,"អេឡិចត្រូទស្សន៍	ជាឧបករណ៍ប្រើសម្រាប់ឲ្យគេដឹងថា អង្គធាតុមួយផ្ទុកបន្ទុកអគ្គិសនីឬក៏នៅ។"
            ,"អេឡិចត្រូមេដែក	ជាមេដែកអចិន្ត្រៃយ៍កើតពីសូលេណូអ៊ីតស៊កបញ្ចូលស្នូលដែក ហើយឆ្លងកាត់ដោយចរន្ត។"
            ,"អេឡិចត្រូស្ដាទិច	ជាការសិក្សាពីបាតុភូតដែលកើតមាននៅជុំវិញបន្ទុកអគ្គិសនីនៅនឹង។"

    };

    UsersAdapter usersAdapter;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        recyclerView = findViewById(R.id.recyclerview);
        toolbar = findViewById(R.id.toolbar);

        this.setSupportActionBar(toolbar);
        this.getSupportActionBar().setTitle("");

        recyclerView.setLayoutManager(new LinearLayoutManager(this));
        recyclerView.addItemDecoration(new DividerItemDecoration(this,DividerItemDecoration.VERTICAL));
        for(String s:names){
            UserModel userModel = new UserModel(s);

            userModelList.add(userModel);
        }
        usersAdapter = new UsersAdapter(userModelList,this);

        recyclerView.setAdapter(usersAdapter);

    }

    @Override
    public void selectedUser(UserModel userModel) {

        startActivity(new Intent(MainActivity.this, SelectedUserActivity.class).putExtra("data",userModel));
    }
    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        getMenuInflater().inflate(R.menu.menu, menu);

        MenuItem menuItem = menu.findItem(R.id.search_view);

        SearchView searchView =(SearchView) menuItem.getActionView();

        searchView.setMaxWidth(Integer.MAX_VALUE);

        searchView.setOnQueryTextListener(new SearchView.OnQueryTextListener() {
            @Override
            public boolean onQueryTextSubmit(String query) {
                return false;
            }

            @Override
            public boolean onQueryTextChange(String newText) {

                usersAdapter.getFilter().filter(newText);
                return true;
            }
        });

        return  true;
    }

    @Override
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        int id = item.getItemId();

        if (id == R.id.search_view){
            return  true;
        }

        return super.onOptionsItemSelected(item);
    }


}